cfd/los_pelambres/template/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| Phase BA.3 - kinematic pressure initial / boundary conditions.             |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }
    outlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    sides
    {
        type            slip;
    }
    top
    {
        type            slip;
    }
    terrain
    {
        type            zeroGradient;
    }
}
