cfd/los_pelambres/template/constant/turbulenceProperties
/*--------------------------------*- C++ -*----------------------------------*\
| Phase BA.3 - RAS k-epsilon turbulence.                                     |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      turbulenceProperties;
}

simulationType  RAS;

RAS
{
    RASModel        kEpsilon;
    turbulence      on;
    printCoeffs     on;
}
