cfd/los_pelambres/template/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| Phase BA.3 - background hex mesh.                                          |
|                                                                            |
| 10 km x 10 km x 3 km bounding box centred on the mine pit.                 |
| Base resolution ~50 m -> 200 x 200 x 60 = 2.4M base cells.                 |
| snappyHexMeshDict refines this near the terrain to ~5M total.              |
|                                                                            |
| Origin is the local Cartesian frame established by                         |
| scripts/cfd/dem_to_stl.py -- centroid of the bbox, x=east, y=north,        |
| z=elevation. blockMesh's z extent (0..3000) covers ground to 3 km AGL.     |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

scale   1;

vertices
(
    (-5000 -5000    0)   //  0
    ( 5000 -5000    0)   //  1
    ( 5000  5000    0)   //  2
    (-5000  5000    0)   //  3
    (-5000 -5000 3000)   //  4
    ( 5000 -5000 3000)   //  5
    ( 5000  5000 3000)   //  6
    (-5000  5000 3000)   //  7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (200 200 60) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        // Patch face is rewritten per-regime by the orchestrator's
        // topoSet step (one of the 4 sides becomes inlet based on
        // wind direction). Default mapping: -y face is inlet.
        type patch;
        faces
        (
            (0 1 5 4)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (3 2 6 7)
        );
    }
    sides
    {
        type patch;
        faces
        (
            (1 2 6 5)
            (0 3 7 4)
        );
    }
    top
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }
    terrain
    {
        // Filled by snappyHexMesh; placeholder bottom face here.
        type wall;
        faces
        (
            (0 3 2 1)
        );
    }
);

mergePatchPairs
(
);
