cfd/los_pelambres/template/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| Phase BA.3 - placeholder topoSetDict.                                      |
|                                                                            |
| The orchestrator may rewrite this per-regime to flip which face is the     |
| inlet (matches the wind direction). Default is empty so a stock run uses   |
| the inlet patch defined in blockMeshDict.                                  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

actions
(
);
